//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//
//int main()
//{
//	//第一种定义方式
//	//数据类型 arr[m][n] =
//	//{
//	//	{1,2,3,4...},				m = 二维数组的长度
//	//	{1,2,3,4...},				n = 一维数组的长度
//	//	{1,2,3,4...}
//	//};
//
//	//第二种定义方式
//	//int arr1[5] = { 1,2,3,4,5 };
//	//int arr2[5] = { 6,7,8,9,0 };
//	//int* arr[2] = { arr1,arr2 };
//	
//	int arr[3][5] =
//	{
//		{1,2,3,4,5},
//		{11,22,33,44,55},
//		{111,222,333,444,555}
//	};
//
//	//arr[0]:表示二维数组中的第一个数组：{1,2,3,4,5}
//
//	for (int i = 0; i < 3; i++)
//	{
//		printf("第%d组一维数组：{",i+1);
//		for (int j = 0; j < 5; j++)
//		{
//			printf("%d ",arr[i][j]);
//		}
//		printf("}\n");
//	}
//
//
//
//	return 0;
//}
//
